def print_star_digits():
    star_digits={
    '2':['    * *    ',
         '  *     *  ',
         '   *    *  ',
         '       *   ',
         '     *     ',
         '    *      ',
         '   *       ',
         '  * * * * *'],
    '3':['   * * *   ',
         '  *      * ',
         '  *      * ',
         '        *  ',
         '    *  *   ',
         '         * ',
         '          *',
         ' *        *',
         '  *      * ',
         '    * * *  '],
    '4':['  *       *',
         '  *       *',
         '  *       *',
         '  *       *',
         '  * * * * *',
         '          *',
         '          *',
         '          *',
         '          *',
         '          *']
    '5':['* * * * * *',
         '*          ',
         '*          ',
         '*          ',
         ' * * * * * ',
         '          *',
         '          *',
         '          *',
         '* * * * *  ']
    '6':['          *',
         '        *  ',
         '      *    ',
         '    *      ',
         '  *   *    ',
         '*       *  ',
         '*        * ',
         '*        * ',
         ' * * * *   ']
   number=input("введите число")
    if number in star_digits:
        for line in star_digits
                print (line)
    else:
            print("2,3,4,5 или 6.")
print_star_digits()
    